Repository: randprotocol/clients
Catalog: ios/RandWallet/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fa, fr, hi, id, it, ja, ko, ms, pl, ps, pt_br, ru, ta, ur, zh_hans, zh_hant_hk

source: This device does not have the memory a swap needs: it makes two of the proofs itself, about 1.5 GB. Nothing was sent. Swap from the desktop app or the browser extension instead.
ar: لا يملك هذا الجهاز الذاكرة التي تحتاجها المبادلة: فهو يُعِدّ إثباتين منها بنفسه، نحو 1.5 غيغابايت. لم يُرسل شيء. بادِل من تطبيق سطح المكتب أو من إضافة المتصفح بدلًا من ذلك.
de: Dieses Gerät hat nicht den Arbeitsspeicher, den ein Tausch braucht: Es erstellt zwei der Beweise selbst, etwa 1.5 GB. Es wurde nichts gesendet. Tausche stattdessen über die Desktop-App oder die Browsererweiterung.
es: Este dispositivo no tiene la memoria que necesita un intercambio: genera dos de las pruebas por sí mismo, unos 1.5 GB. No se envió nada. Intercambia desde la app de escritorio o la extensión del navegador.
fa: این دستگاه حافظه‌ای را که سواپ نیاز دارد ندارد: دو تا از اثبات‌ها را خودش می‌سازد، حدود 1.5 گیگابایت. چیزی ارسال نشد. به‌جای آن از برنامه‌ی دسکتاپ یا افزونه‌ی مرورگر سواپ کنید.
fr: Cet appareil n'a pas la mémoire nécessaire à un échange : il génère lui-même deux des preuves, environ 1.5 Go. Rien n'a été envoyé. Échangez plutôt depuis l'application de bureau ou l'extension de navigateur.
hi: इस डिवाइस में स्वैप के लिए आवश्यक मेमोरी नहीं है: यह दो प्रूफ़ खुद बनाता है, लगभग 1.5 GB। कुछ भी नहीं भेजा गया। इसके बजाय डेस्कटॉप ऐप या ब्राउज़र एक्सटेंशन से स्वैप करें।
id: Perangkat ini tidak memiliki memori yang dibutuhkan penukaran: perangkat membuat dua buktinya sendiri, sekitar 1.5 GB. Tidak ada yang dikirim. Lakukan penukaran dari aplikasi desktop atau ekstensi browser.
it: Questo dispositivo non ha la memoria che serve a uno scambio: genera da sé due delle prove, circa 1.5 GB. Non è stato inviato nulla. Scambia invece dall'app desktop o dall'estensione del browser.
ja: この端末にはスワップに必要なメモリがありません。スワップでは証明のうち2つを端末自身が作り、約 1.5 GB を使います。何も送信されていません。代わりにデスクトップアプリかブラウザ拡張機能からスワップしてください。
ko: 이 기기에는 스왑에 필요한 메모리가 부족합니다. 스왑에서는 증명 두 개를 기기가 직접 만들며 약 1.5 GB가 필요합니다. 아무것도 전송되지 않았습니다. 대신 데스크톱 앱이나 브라우저 확장 프로그램에서 스왑하세요.
ms: Peranti ini tidak mempunyai memori yang diperlukan untuk pertukaran: ia membuat dua daripada bukti itu sendiri, kira-kira 1.5 GB. Tiada apa-apa dihantar. Buat pertukaran daripada aplikasi desktop atau sambungan pelayar.
pl: To urządzenie nie ma pamięci potrzebnej do wymiany: samo generuje dwa z dowodów, około 1.5 GB. Nic nie wysłano. Wymień zamiast tego w aplikacji desktopowej lub rozszerzeniu przeglądarki.
ps: دا وسیله هغه حافظه نه لري چې تبادلې ته اړینه ده: دوه ثبوتونه پخپله جوړوي، شاوخوا 1.5 GB. هېڅ ونه لېږل شو. پر ځای یې د ډیسټاپ اپ یا براوزر توسیع څخه تبادله وکړئ.
pt_br: Este dispositivo não tem a memória de que uma troca precisa: ele mesmo gera duas das provas, cerca de 1.5 GB. Nada foi enviado. Faça a troca pelo app para computador ou pela extensão do navegador.
ru: Этому устройству не хватает памяти для обмена: два доказательства оно строит само, это около 1.5 ГБ. Ничего не отправлено. Выполните обмен в настольном приложении или в расширении браузера.
ta: ஒரு ஸ்வாப்புக்குத் தேவையான நினைவகம் இந்தச் சாதனத்தில் இல்லை: அது இரண்டு நிரூபணங்களைத் தானே உருவாக்குகிறது, சுமார் 1.5 GB. எதுவும் அனுப்பப்படவில்லை. அதற்குப் பதிலாக டெஸ்க்டாப் ஆப் அல்லது உலாவி நீட்டிப்பிலிருந்து ஸ்வாப் செய்யவும்.
ur: اس ڈیوائس میں اتنی میموری نہیں جو سواپ کو درکار ہے: یہ دو پروف خود بناتی ہے، تقریباً 1.5 GB۔ کچھ نہیں بھیجا گیا۔ اس کے بجائے ڈیسک ٹاپ ایپ یا براؤزر ایکسٹینشن سے سواپ کریں۔
zh_hans: 此设备的内存不足以完成兑换：其中两个证明需由它自己生成，约需 1.5 GB。未发送任何内容。请改用桌面应用或浏览器扩展进行兑换。
zh_hant_hk: 此裝置的記憶體不足以完成兌換：其中兩個證明要由它自己生成，約需 1.5 GB。沒有傳送任何東西。請改用桌面應用程式或瀏覽器擴充功能兌換。

source: This device does not have the memory for this proof, and no prover is set up. Pair a prover in Settings › Prover.
ar: لا يملك هذا الجهاز الذاكرة اللازمة لهذا الإثبات، ولم يُعَدّ أي مُثبِت. اقرن مُثبِتًا في الإعدادات › المُثبِت.
de: Dieses Gerät hat nicht genug Arbeitsspeicher für diesen Beweis, und kein Prover ist eingerichtet. Kopple einen Prover unter Einstellungen › Prover.
es: Este dispositivo no tiene memoria suficiente para esta prueba y no hay ningún probador configurado. Vincula un probador en Ajustes › Probador.
fa: این دستگاه حافظه‌ی لازم برای این اثبات را ندارد و هیچ اثبات‌گری تنظیم نشده است. در تنظیمات › اثبات‌گر یک اثبات‌گر جفت کنید.
fr: Cet appareil n'a pas la mémoire nécessaire pour cette preuve, et aucun prouveur n'est configuré. Associez un prouveur dans Paramètres › Prouveur.
hi: इस डिवाइस में इस प्रूफ़ के लिए पर्याप्त मेमोरी नहीं है, और कोई प्रूवर सेट नहीं है। सेटिंग्स › प्रूवर में एक प्रूवर पेयर करें।
id: Perangkat ini tidak memiliki cukup memori untuk bukti ini, dan belum ada prover yang diatur. Pasangkan prover di Pengaturan › Prover.
it: Questo dispositivo non ha la memoria per questa prova e non è configurato alcun prover. Associa un prover in Impostazioni › Prover.
ja: この端末にはこの証明に必要なメモリがなく、プルーバーも設定されていません。設定 › プルーバーでプルーバーをペアリングしてください。
ko: 이 기기에는 이 증명에 필요한 메모리가 부족하고, 설정된 프루버도 없습니다. 설정 › 프루버에서 프루버를 페어링하세요.
ms: Peranti ini tidak mempunyai memori untuk bukti ini, dan tiada pembukti disediakan. Pasangkan pembukti dalam Tetapan › Pembukti.
pl: To urządzenie nie ma pamięci na ten dowód, a żaden prover nie jest skonfigurowany. Sparuj prover w Ustawienia › Prover.
ps: دا وسیله د دې ثبوت لپاره حافظه نه لري، او کوم ثبوت جوړوونکی نه دی ټاکل شوی. په امستنې › ثبوت جوړوونکی کې یو ثبوت جوړوونکی جوړه کړئ.
pt_br: Este dispositivo não tem memória para esta prova e nenhum provador está configurado. Pareie um provador em Configurações › Provador.
ru: Этому устройству не хватает памяти для этого доказательства, а прувер не настроен. Подключите прувер в разделе «Настройки › Прувер».
ta: இந்த நிரூபணத்துக்குத் தேவையான நினைவகம் இந்தச் சாதனத்தில் இல்லை, நிரூபிப்பான் எதுவும் அமைக்கப்படவில்லை. அமைப்புகள் › நிரூபிப்பான் என்பதில் ஒரு நிரூபிப்பானை இணைக்கவும்.
ur: اس ڈیوائس میں اس پروف کے لیے کافی میموری نہیں، اور کوئی پروور سیٹ نہیں ہے۔ ترتیبات › پروور میں ایک پروور جوڑیں۔
zh_hans: 此设备内存不足，无法生成此证明，且尚未设置证明器。请在“设置 › 证明器”中配对证明器。
zh_hant_hk: 此裝置的記憶體不足以生成此證明，而且尚未設定證明器。請在「設定 › 證明器」中配對證明器。

source: This device does not have the memory for this proof, so one of the %@ provers will make it. The one that does receives your viewing key and a salt inside a sealed job — never your spend key: it can read this wallet's whole history and cannot spend. This phone authorises the spend itself and checks the proof before anything is sent.
ar: لا يملك هذا الجهاز الذاكرة اللازمة لهذا الإثبات، لذا سيُعِدّه أحد مُثبِتات %@. المُثبِت الذي يُعِدّه يتلقى مفتاح العرض وملحًا داخل مهمة مختومة — ولا يتلقى مفتاح الإنفاق أبدًا: يستطيع قراءة سجل هذه المحفظة كاملًا ولا يستطيع الإنفاق. هذا الهاتف يفوّض الإنفاق بنفسه ويتحقق من الإثبات قبل إرسال أي شيء.
de: Dieses Gerät hat nicht genug Arbeitsspeicher für diesen Beweis, daher erstellt ihn einer der %@-Prover. Der Prover, der es tut, erhält deinen Ansichtsschlüssel und ein Salt in einem versiegelten Auftrag – niemals deinen Ausgabeschlüssel: Er kann den gesamten Verlauf dieser Wallet lesen und nichts ausgeben. Dieses Telefon autorisiert die Ausgabe selbst und prüft den Beweis, bevor etwas gesendet wird.
es: Este dispositivo no tiene memoria suficiente para esta prueba, así que la generará uno de los probadores de %@. El que lo haga recibe tu clave de visualización y una sal dentro de un trabajo sellado, nunca tu clave de gasto: puede leer todo el historial de esta billetera y no puede gastar. Este teléfono autoriza el gasto por sí mismo y verifica la prueba antes de enviar nada.
fa: این دستگاه حافظه‌ی لازم برای این اثبات را ندارد، پس یکی از اثبات‌گرهای %@ آن را می‌سازد. اثبات‌گری که آن را می‌سازد کلید مشاهده‌ی شما و یک نمک را درون یک کار مهر و موم‌شده دریافت می‌کند — هرگز کلید خرج شما را: می‌تواند کل تاریخچه‌ی این کیف پول را بخواند و نمی‌تواند خرج کند. این گوشی خودش مجوز خرج را می‌دهد و پیش از ارسال هر چیزی اثبات را بررسی می‌کند.
fr: Cet appareil n'a pas la mémoire nécessaire pour cette preuve ; l'un des prouveurs %@ la générera donc. Celui qui le fait reçoit votre clé de visualisation et un sel dans une tâche scellée — jamais votre clé de dépense : il peut lire tout l'historique de ce portefeuille et ne peut pas dépenser. Ce téléphone autorise lui-même la dépense et vérifie la preuve avant tout envoi.
hi: इस डिवाइस में इस प्रूफ़ के लिए पर्याप्त मेमोरी नहीं है, इसलिए %@ प्रूवर में से एक इसे बनाएगा। जो बनाएगा उसे एक सील्ड जॉब के अंदर आपकी व्यूइंग की और एक सॉल्ट मिलता है — आपकी स्पेंड की कभी नहीं: वह इस वॉलेट का पूरा इतिहास पढ़ सकता है और खर्च नहीं कर सकता। यह फ़ोन खर्च को खुद अधिकृत करता है और कुछ भी भेजने से पहले प्रूफ़ की जाँच करता है।
id: Perangkat ini tidak memiliki cukup memori untuk bukti ini, jadi salah satu prover %@ akan membuatnya. Prover yang membuatnya menerima kunci tampilan Anda dan sebuah salt di dalam tugas yang disegel — tidak pernah kunci belanja Anda: prover dapat membaca seluruh riwayat dompet ini dan tidak dapat membelanjakan. Ponsel ini sendiri yang mengotorisasi pembelanjaan dan memeriksa bukti sebelum apa pun dikirim.
it: Questo dispositivo non ha la memoria per questa prova, quindi la genererà uno dei prover di %@. Quello che lo fa riceve la tua chiave di visualizzazione e un salt in un lavoro sigillato — mai la tua chiave di spesa: può leggere tutta la cronologia di questo portafoglio e non può spendere. Questo telefono autorizza da sé la spesa e verifica la prova prima di inviare qualsiasi cosa.
ja: この端末にはこの証明に必要なメモリがないため、%@ のプルーバーのいずれかが作成します。作成するプルーバーは、封印されたジョブの中で閲覧キーとソルトを受け取り、支出キーは決して受け取りません。このウォレットの履歴をすべて読めますが、支出はできません。支出の承認はこのスマートフォン自身が行い、何かを送信する前に証明を検証します。
ko: 이 기기에는 이 증명에 필요한 메모리가 부족하므로 %@ 프루버 중 하나가 증명을 만듭니다. 그 프루버는 봉인된 작업 안에서 조회 키와 솔트를 받으며, 지출 키는 절대 받지 않습니다. 이 지갑의 전체 내역을 읽을 수 있지만 지출은 할 수 없습니다. 지출 승인은 이 휴대폰이 직접 하며, 무엇이든 전송하기 전에 증명을 확인합니다.
ms: Peranti ini tidak mempunyai memori untuk bukti ini, jadi salah satu pembukti %@ akan membuatnya. Pembukti yang membuatnya menerima kunci tontonan anda dan garam dalam kerja bermeterai — tidak sekali-kali kunci perbelanjaan anda: ia boleh membaca seluruh sejarah dompet ini dan tidak boleh berbelanja. Telefon ini membenarkan perbelanjaan itu sendiri dan menyemak bukti sebelum apa-apa dihantar.
pl: To urządzenie nie ma pamięci na ten dowód, więc wygeneruje go jeden z proverów %@. Ten, który to zrobi, otrzyma twój klucz podglądu i sól w zapieczętowanym zadaniu — nigdy twój klucz wydawania: może czytać całą historię tego portfela i nie może wydawać. Ten telefon sam autoryzuje wydanie i sprawdza dowód, zanim cokolwiek zostanie wysłane.
ps: دا وسیله د دې ثبوت لپاره حافظه نه لري، نو د %@ له ثبوت جوړوونکو څخه یو به یې جوړ کړي. هغه چې یې جوړوي، ستاسو د لیدو کیلي او یو مالګه (salt) په یوه مهر شوې دنده کې ترلاسه کوي — هېڅکله ستاسو د لګښت کیلي نه: د دې والټ ټوله تاریخچه لوستلی شي او لګښت نشي کولی. دا تلیفون پخپله لګښت ته اجازه ورکوي او مخکې له دې چې څه ولېږل شي، ثبوت کتل کوي.
pt_br: Este dispositivo não tem memória para esta prova, então um dos provadores %@ vai gerá-la. O que a gerar recebe sua chave de visualização e um sal dentro de um trabalho selado — nunca sua chave de gasto: pode ler todo o histórico desta carteira e não pode gastar. Este celular autoriza o gasto ele mesmo e verifica a prova antes de qualquer envio.
ru: Этому устройству не хватает памяти для этого доказательства, поэтому его построит один из пруверов %@. Тот, кто его строит, получает ваш ключ просмотра и соль внутри зашифрованного задания — но никогда не ключ расходования: он может читать всю историю этого кошелька, но тратить не может. Этот телефон сам авторизует трату и проверяет доказательство, прежде чем что-либо отправить.
ta: இந்த நிரூபணத்துக்குத் தேவையான நினைவகம் இந்தச் சாதனத்தில் இல்லை, எனவே %@ நிரூபிப்பான்களில் ஒன்று அதை உருவாக்கும். அதைச் செய்யும் நிரூபிப்பான் முத்திரையிடப்பட்ட வேலைக்குள் உங்கள் பார்வை விசையையும் ஒரு salt-ஐயும் பெறும் — உங்கள் செலவு விசையை ஒருபோதும் அல்ல: அது இந்த வாலட்டின் முழு வரலாற்றையும் படிக்க முடியும், செலவு செய்ய முடியாது. இந்தத் தொலைபேசியே செலவை அங்கீகரித்து, எதையும் அனுப்பும் முன் நிரூபணத்தைச் சரிபார்க்கும்.
ur: اس ڈیوائس میں اس پروف کے لیے کافی میموری نہیں، اس لیے %@ پروور میں سے ایک اسے بنائے گا۔ جو بنائے گا اسے ایک سیل بند کام کے اندر آپ کی ویوئنگ کی اور ایک سالٹ ملتا ہے — آپ کی اسپینڈ کی کبھی نہیں: یہ اس والیٹ کی پوری تاریخ پڑھ سکتا ہے اور خرچ نہیں کر سکتا۔ یہ فون خرچ کی اجازت خود دیتا ہے اور کچھ بھی بھیجنے سے پہلے پروف کی جانچ کرتا ہے۔
zh_hans: 此设备内存不足，无法生成此证明，因此将由一台 %@ 证明器生成。生成证明的那台会在加密任务中收到你的查看密钥和一个盐值——绝不会收到你的花费密钥：它能读取此钱包的全部历史记录，但不能花费。这部手机会自行授权花费，并在发送任何内容之前检查证明。
zh_hant_hk: 此裝置的記憶體不足以生成此證明，因此會由一部 %@ 證明器生成。生成證明的那部會在加密工作中收到你的檢視密鑰和一個鹽值，但絕不會收到你的花費私鑰：它可以讀取此錢包的全部記錄，但不能花費。這部手機會自行授權花費，並在傳送任何東西之前檢查證明。

source: This device does not have the memory for this proof, so your prover, %@, will make it. It receives your viewing key and a salt inside a sealed job — never your spend key: it can read this wallet's whole history and cannot spend. This phone authorises the spend itself and checks the proof before anything is sent.
ar: لا يملك هذا الجهاز الذاكرة اللازمة لهذا الإثبات، لذا سيُعِدّه مُثبِتك، %@. يتلقى مفتاح العرض وملحًا داخل مهمة مختومة — ولا يتلقى مفتاح الإنفاق أبدًا: يستطيع قراءة سجل هذه المحفظة كاملًا ولا يستطيع الإنفاق. هذا الهاتف يفوّض الإنفاق بنفسه ويتحقق من الإثبات قبل إرسال أي شيء.
de: Dieses Gerät hat nicht genug Arbeitsspeicher für diesen Beweis, daher erstellt ihn dein Prover %@. Er erhält deinen Ansichtsschlüssel und ein Salt in einem versiegelten Auftrag – niemals deinen Ausgabeschlüssel: Er kann den gesamten Verlauf dieser Wallet lesen und nichts ausgeben. Dieses Telefon autorisiert die Ausgabe selbst und prüft den Beweis, bevor etwas gesendet wird.
es: Este dispositivo no tiene memoria suficiente para esta prueba, así que la generará tu probador, %@. Recibe tu clave de visualización y una sal dentro de un trabajo sellado, nunca tu clave de gasto: puede leer todo el historial de esta billetera y no puede gastar. Este teléfono autoriza el gasto por sí mismo y verifica la prueba antes de enviar nada.
fa: این دستگاه حافظه‌ی لازم برای این اثبات را ندارد، پس اثبات‌گر شما، %@، آن را می‌سازد. کلید مشاهده‌ی شما و یک نمک را درون یک کار مهر و موم‌شده دریافت می‌کند — هرگز کلید خرج شما را: می‌تواند کل تاریخچه‌ی این کیف پول را بخواند و نمی‌تواند خرج کند. این گوشی خودش مجوز خرج را می‌دهد و پیش از ارسال هر چیزی اثبات را بررسی می‌کند.
fr: Cet appareil n'a pas la mémoire nécessaire pour cette preuve ; votre prouveur, %@, la générera donc. Il reçoit votre clé de visualisation et un sel dans une tâche scellée — jamais votre clé de dépense : il peut lire tout l'historique de ce portefeuille et ne peut pas dépenser. Ce téléphone autorise lui-même la dépense et vérifie la preuve avant tout envoi.
hi: इस डिवाइस में इस प्रूफ़ के लिए पर्याप्त मेमोरी नहीं है, इसलिए आपका प्रूवर, %@, इसे बनाएगा। उसे एक सील्ड जॉब के अंदर आपकी व्यूइंग की और एक सॉल्ट मिलता है — आपकी स्पेंड की कभी नहीं: वह इस वॉलेट का पूरा इतिहास पढ़ सकता है और खर्च नहीं कर सकता। यह फ़ोन खर्च को खुद अधिकृत करता है और कुछ भी भेजने से पहले प्रूफ़ की जाँच करता है।
id: Perangkat ini tidak memiliki cukup memori untuk bukti ini, jadi prover Anda, %@, akan membuatnya. Prover menerima kunci tampilan Anda dan sebuah salt di dalam tugas yang disegel — tidak pernah kunci belanja Anda: prover dapat membaca seluruh riwayat dompet ini dan tidak dapat membelanjakan. Ponsel ini sendiri yang mengotorisasi pembelanjaan dan memeriksa bukti sebelum apa pun dikirim.
it: Questo dispositivo non ha la memoria per questa prova, quindi la genererà il tuo prover, %@. Riceve la tua chiave di visualizzazione e un salt in un lavoro sigillato — mai la tua chiave di spesa: può leggere tutta la cronologia di questo portafoglio e non può spendere. Questo telefono autorizza da sé la spesa e verifica la prova prima di inviare qualsiasi cosa.
ja: この端末にはこの証明に必要なメモリがないため、あなたのプルーバー %@ が作成します。プルーバーは封印されたジョブの中で閲覧キーとソルトを受け取り、支出キーは決して受け取りません。このウォレットの履歴をすべて読めますが、支出はできません。支出の承認はこのスマートフォン自身が行い、何かを送信する前に証明を検証します。
ko: 이 기기에는 이 증명에 필요한 메모리가 부족하므로 내 프루버 %@이(가) 증명을 만듭니다. 프루버는 봉인된 작업 안에서 조회 키와 솔트를 받으며, 지출 키는 절대 받지 않습니다. 이 지갑의 전체 내역을 읽을 수 있지만 지출은 할 수 없습니다. 지출 승인은 이 휴대폰이 직접 하며, 무엇이든 전송하기 전에 증명을 확인합니다.
ms: Peranti ini tidak mempunyai memori untuk bukti ini, jadi pembukti anda, %@, akan membuatnya. Ia menerima kunci tontonan anda dan garam dalam kerja bermeterai — tidak sekali-kali kunci perbelanjaan anda: ia boleh membaca seluruh sejarah dompet ini dan tidak boleh berbelanja. Telefon ini membenarkan perbelanjaan itu sendiri dan menyemak bukti sebelum apa-apa dihantar.
pl: To urządzenie nie ma pamięci na ten dowód, więc wygeneruje go twój prover, %@. Otrzyma twój klucz podglądu i sól w zapieczętowanym zadaniu — nigdy twój klucz wydawania: może czytać całą historię tego portfela i nie może wydawać. Ten telefon sam autoryzuje wydanie i sprawdza dowód, zanim cokolwiek zostanie wysłane.
ps: دا وسیله د دې ثبوت لپاره حافظه نه لري، نو ستاسو ثبوت جوړوونکی، %@، به یې جوړ کړي. هغه ستاسو د لیدو کیلي او یو مالګه (salt) په یوه مهر شوې دنده کې ترلاسه کوي — هېڅکله ستاسو د لګښت کیلي نه: د دې والټ ټوله تاریخچه لوستلی شي او لګښت نشي کولی. دا تلیفون پخپله لګښت ته اجازه ورکوي او مخکې له دې چې څه ولېږل شي، ثبوت کتل کوي.
pt_br: Este dispositivo não tem memória para esta prova, então seu provador, %@, vai gerá-la. Ele recebe sua chave de visualização e um sal dentro de um trabalho selado — nunca sua chave de gasto: pode ler todo o histórico desta carteira e não pode gastar. Este celular autoriza o gasto ele mesmo e verifica a prova antes de qualquer envio.
ru: Этому устройству не хватает памяти для этого доказательства, поэтому его построит ваш прувер %@. Он получает ваш ключ просмотра и соль внутри зашифрованного задания — но никогда не ключ расходования: он может читать всю историю этого кошелька, но тратить не может. Этот телефон сам авторизует трату и проверяет доказательство, прежде чем что-либо отправить.
ta: இந்த நிரூபணத்துக்குத் தேவையான நினைவகம் இந்தச் சாதனத்தில் இல்லை, எனவே உங்கள் நிரூபிப்பான் %@ அதை உருவாக்கும். அது முத்திரையிடப்பட்ட வேலைக்குள் உங்கள் பார்வை விசையையும் ஒரு salt-ஐயும் பெறும் — உங்கள் செலவு விசையை ஒருபோதும் அல்ல: அது இந்த வாலட்டின் முழு வரலாற்றையும் படிக்க முடியும், செலவு செய்ய முடியாது. இந்தத் தொலைபேசியே செலவை அங்கீகரித்து, எதையும் அனுப்பும் முன் நிரூபணத்தைச் சரிபார்க்கும்.
ur: اس ڈیوائس میں اس پروف کے لیے کافی میموری نہیں، اس لیے آپ کا پروور، %@، اسے بنائے گا۔ اسے ایک سیل بند کام کے اندر آپ کی ویوئنگ کی اور ایک سالٹ ملتا ہے — آپ کی اسپینڈ کی کبھی نہیں: یہ اس والیٹ کی پوری تاریخ پڑھ سکتا ہے اور خرچ نہیں کر سکتا۔ یہ فون خرچ کی اجازت خود دیتا ہے اور کچھ بھی بھیجنے سے پہلے پروف کی جانچ کرتا ہے۔
zh_hans: 此设备内存不足，无法生成此证明，因此将由你的证明器 %@ 生成。它会在加密任务中收到你的查看密钥和一个盐值——绝不会收到你的花费密钥：它能读取此钱包的全部历史记录，但不能花费。这部手机会自行授权花费，并在发送任何内容之前检查证明。
zh_hant_hk: 此裝置的記憶體不足以生成此證明，因此會由你的證明器 %@ 生成。它會在加密工作中收到你的檢視密鑰和一個鹽值，但絕不會收到你的花費私鑰：它可以讀取此錢包的全部記錄，但不能花費。這部手機會自行授權花費，並在傳送任何東西之前檢查證明。

source: This device does not have the memory for this proof.
ar: لا يملك هذا الجهاز الذاكرة اللازمة لهذا الإثبات.
de: Dieses Gerät hat nicht genug Arbeitsspeicher für diesen Beweis.
es: Este dispositivo no tiene memoria suficiente para esta prueba.
fa: این دستگاه حافظه‌ی لازم برای این اثبات را ندارد.
fr: Cet appareil n'a pas la mémoire nécessaire pour cette preuve.
hi: इस डिवाइस में इस प्रूफ़ के लिए पर्याप्त मेमोरी नहीं है।
id: Perangkat ini tidak memiliki cukup memori untuk bukti ini.
it: Questo dispositivo non ha la memoria per questa prova.
ja: この端末にはこの証明に必要なメモリがありません。
ko: 이 기기에는 이 증명에 필요한 메모리가 부족합니다.
ms: Peranti ini tidak mempunyai memori untuk bukti ini.
pl: To urządzenie nie ma pamięci na ten dowód.
ps: دا وسیله د دې ثبوت لپاره حافظه نه لري.
pt_br: Este dispositivo não tem memória para esta prova.
ru: Этому устройству не хватает памяти для этого доказательства.
ta: இந்த நிரூபணத்துக்குத் தேவையான நினைவகம் இந்தச் சாதனத்தில் இல்லை.
ur: اس ڈیوائس میں اس پروف کے لیے کافی میموری نہیں۔
zh_hans: 此设备内存不足，无法生成此证明。
zh_hant_hk: 此裝置的記憶體不足以生成此證明。

source: This device proves the swap. It takes a few minutes.
ar: يُثبت هذا الجهاز المبادلة. يستغرق ذلك بضع دقائق.
de: Dieses Gerät beweist den Tausch. Es dauert ein paar Minuten.
es: Este dispositivo genera la prueba del intercambio. Tarda unos minutos.
fa: این دستگاه سواپ را اثبات می‌کند. چند دقیقه طول می‌کشد.
fr: Cet appareil prouve l'échange. Cela prend quelques minutes.
hi: यह डिवाइस स्वैप का प्रूफ़ बनाता है। इसमें कुछ मिनट लगते हैं।
id: Perangkat ini membuktikan penukaran. Prosesnya beberapa menit.
it: Questo dispositivo prova lo scambio. Richiede qualche minuto.
ja: この端末がスワップを証明します。数分かかります。
ko: 이 기기에서 스왑을 증명합니다. 몇 분 정도 걸립니다.
ms: Peranti ini membuktikan pertukaran. Ia mengambil masa beberapa minit.
pl: To urządzenie generuje dowód wymiany. To zajmuje kilka minut.
ps: دا وسیله د تبادلې ثبوت جوړوي. څو دقیقې وخت نیسي.
pt_br: Este dispositivo prova a troca. Leva alguns minutos.
ru: Это устройство строит доказательство обмена. Это занимает несколько минут.
ta: இந்தச் சாதனம் ஸ்வாப்பை நிரூபிக்கும். இதற்குச் சில நிமிடங்கள் ஆகும்.
ur: یہ ڈیوائس سواپ کا پروف بناتی ہے۔ اس میں چند منٹ لگتے ہیں۔
zh_hans: 此设备为兑换生成证明。这需要几分钟。
zh_hant_hk: 此裝置會為兌換生成證明，需時數分鐘。

source: This link is too long for a QR code; share or copy it instead.
ar: هذا الرابط أطول من أن يُعرض في رمز QR، شاركه أو انسخه بدلًا من ذلك.
de: Dieser Link ist zu lang für einen QR-Code; teile oder kopiere ihn stattdessen.
es: Este enlace es demasiado largo para un código QR; compártelo o cópialo en su lugar.
fa: این لینک برای کد QR بیش از حد طولانی است؛ به‌جای آن به اشتراک بگذارید یا کپی کنید.
fr: Ce lien est trop long pour un code QR ; partagez-le ou copiez-le plutôt.
hi: यह लिंक QR कोड के लिए बहुत लंबा है; इसके बजाय इसे साझा या कॉपी करें।
id: Tautan ini terlalu panjang untuk kode QR; bagikan atau salin saja.
it: Questo link è troppo lungo per un codice QR; condividilo o copialo invece.
ja: このリンクは QR コードには長すぎます。代わりに共有またはコピーしてください。
ko: 이 링크는 QR 코드로 만들기에 너무 깁니다. 대신 공유하거나 복사하세요.
ms: Pautan ini terlalu panjang untuk kod QR; kongsi atau salin sahaja.
pl: Ten link jest za długi na kod QR; udostępnij go lub skopiuj.
ps: دا لینک د QR کوډ لپاره ډېر اوږد دی؛ پر ځای یې شریک یا کاپي کړئ.
pt_br: Este link é longo demais para um QR code; compartilhe-o ou copie-o.
ru: Ссылка слишком длинная для QR-кода; поделитесь ею или скопируйте её.
ta: இந்த இணைப்பு QR குறியீட்டுக்கு மிக நீளமானது; அதற்குப் பதிலாக அதைப் பகிரவும் அல்லது நகலெடுக்கவும்.
ur: یہ لنک QR کوڈ کے لیے بہت لمبا ہے؛ اس کے بجائے اسے شیئر یا کاپی کریں۔
zh_hans: 此链接太长，无法生成二维码；请改为分享或复制。
zh_hant_hk: 此連結太長，無法製成 QR 碼；請改為分享或複製。

source: This network doesn't carry memos; the memo will not be sent
ar: هذه الشبكة لا تحمل مذكرات، ولن تُرسل المذكرة
de: Dieses Netzwerk überträgt keine Memos; das Memo wird nicht gesendet
es: Esta red no admite memos; el memo no se enviará
fa: این شبکه یادداشت حمل نمی‌کند؛ یادداشت ارسال نخواهد شد
fr: Ce réseau ne prend pas en charge les mémos ; le mémo ne sera pas envoyé
hi: यह नेटवर्क मेमो नहीं रखता; मेमो नहीं भेजा जाएगा
id: Jaringan ini tidak membawa memo; memo tidak akan dikirim
it: Questa rete non trasporta memo; il memo non verrà inviato
ja: このネットワークはメモを扱いません。メモは送信されません
ko: 이 네트워크는 메모를 지원하지 않으므로 메모가 전송되지 않습니다
ms: Rangkaian ini tidak membawa memo; memo tidak akan dihantar
pl: Ta sieć nie przenosi memo; memo nie zostanie wysłane
ps: دا شبکه یادښتونه نه لېږدوي؛ یادښت به ونه لېږل شي
pt_br: Esta rede não aceita memos; o memo não será enviado
ru: Эта сеть не передаёт мемо; мемо не будет отправлено
ta: இந்த நெட்வொர்க் குறிப்புகளைக் கொண்டு செல்வதில்லை; குறிப்பு அனுப்பப்படாது
ur: یہ نیٹ ورک میمو نہیں رکھتا؛ میمو نہیں بھیجا جائے گا
zh_hans: 此网络不支持备注；备注不会被发送
zh_hant_hk: 此網絡不支援備註；備註不會被傳送
